Tekla Open API Reference for Tekla Structures 2025
View.RestrictionBox Property
 The axis aligned bounding box that represents the volume of the view.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AABB RestrictionBox { get; set; }
Public Property RestrictionBox As AABB
	Get
	Set
Property Value
Type: AABB
See Also
Reference
View Class
Tekla.Structures.Drawing Namespace
View.GetVisibleAreaRestrictionBoxes()